app/Views/main/templates/sidebar.php

SELECT *
FROM `user_permissions`
WHERE `role` = 'Super-admin'
 LIMIT 1
---
<?php
$permissionModel = new \App\Models\user_permission();
$role = $permissionModel->where('role',session()->get('role'))->first();