app/Views/users/search-team.php

                                        <?php
                                        if($list['remarks']=="OPEN"){
                                        $playerModel = new \App\Models\playerModel();
                                        $player = $playerModel->where('user_id',session()->get('User'))
                                                              ->where('team_id',$list['team_id'])
                                                              ->first();
---
SELECT *
FROM `players`
WHERE `user_id` = '2'
AND `team_id` = '3'
 LIMIT 1