app/Views/main/roster/teams/view.php

SELECT *
FROM `users`
WHERE `user_id` = '2'
 LIMIT 1
---
                                                            $role = $roleModel->where('roleID',$row['roleID'])->first();
                                                            //name
                                                            $userModel = new \App\Models\userModel();
                                                            $user = $userModel->where('user_id',$row['user_id'])->first();