app/Views/main/events/index.php

SELECT *
FROM `events`
WHERE `Status` = 1
---
<?php $eventData = array();?>
<?php
        $eventModel = new \App\Models\eventModel();
        $event = $eventModel->WHERE('Status',1)->findAll();