app/Controllers/Home.php

    public function index(): string
    {
        $title = "Home";
        $newsModel = new \App\Models\newsModel();
        $videoModel = new \App\Models\videoModel();
        $eventModel = new \App\Models\eventModel();
        $registerModel = new \App\Models\registerModel();
        $teamModel = new \App\Models\teamModel();
        $subscribeModel = new \App\Models\subscribeModel();

        $videos = array_map(function($v) {
            return [
                'type' => 'video',
                'title' => $v['file_name'],
                'content' => substr($v['description'],0,300),
                'timestamp' => strtotime($v['date']),
                'media'=> 'assets/videos/'.$v['file'],
                'link'=>'latest-videos/watch/'.$v['Token']
            ];
        }, $videoModel->findAll());

        $events = array_map(function($e) {
            return [
                'type' => 'event',
                'title' => $e['event_title'],
                'content' => substr($e['event_description'],0,300),
                'timestamp' => strtotime($e['start_date']),
                'media'=> 'assets/images/logo.jpg',
                'link'=>'latest-events/details/'.$e['event_title']
            ];
        }, $eventModel->findAll());

        $news = array_map(function($n) {
            return [
                'type' => 'news',
                'title' => $n['topic'],
                'content' => substr($n['details'],0,300),
                'timestamp' => strtotime($n['date']),
                'media'=>'assets/images/news/'.$n['image'],
                'link'=>'latest-news/stories/'.$n['topic']
            ];
        }, $newsModel->findAll());
---
SELECT *
FROM `videos`
SELECT *
FROM `events`
SELECT *
FROM `news`

        $feed = array_merge($videos, $events, $news);
        usort($feed, fn($a, $b) => $b['timestamp'] <=> $a['timestamp']);
        //recent
        $recent = $newsModel->WHERE('headline',1)->findAll();
---
SELECT *
FROM `news`
WHERE `headline` = 1

        $register = $registerModel->where('user_id',session()->get('User'))
                 ->where('status',1)->first() ?? '';
        //team for coach
        $team = $teamModel->where('user_id',session()->get('User'))->findAll();
        //player
        $player  = $this->db->table('players as a')
                    ->select('b.team_name,b.school_barangay,b.image,a.status')
                    ->join('teams as b','b.team_id=a.team_id')->where('a.status',1)
                    ->where('a.user_id',session()->get('User'));
        $playerData = $player->get()->getResult();
        //matches
        $builder = $this->db->table('matches as a')
                    ->select("a.*,TIME_FORMAT(a.time, '%h:%i:%s %p') as time,CONCAT(b.team_name,' VS ',c.team_name)team_name")
                    ->join('teams as b','b.team_id=a.team1_id')
                    ->join('teams as c','c.team_id=a.team2_id')
                    ->join('players d','d.team_id=b.team_id OR d.team_id=c.team_id','LEFT')
                    ->groupBy('a.match_id')->limit(5);
        $matches = $builder->get()->getResult();
        //subscription
        $subscribe = $subscribeModel->where('user_id',session()->get('User'))->first() ?? '';
        //schedules
        $schedules = $this->db->table('players as a')->select('b.*')
                    ->join('schedules as b','b.team_id=a.team_id','INNER')
                    ->where('a.user_id',session()->get('User'))
                    ->groupBy('b.schedule_id')
                    ->orderBy('b.schedule_id','DESC')
                    ->get()->getResult();
---
SELECT *
FROM `teams`
WHERE `user_id` = '2'
SELECT `b`.`team_name`, `b`.`school_barangay`, `b`.`image`, `a`.`status`
FROM `players` as `a`
JOIN `teams` as `b` ON `b`.`team_id`=`a`.`team_id`
WHERE `a`.`status` = 1
AND `a`.`user_id` IS NULL
SELECT `a`.*, TIME_FORMAT(a.time, '%h:%i:%s %p') as time, CONCAT(b.team_name, ' VS ', c.team_name)team_name
FROM `matches` as `a`
JOIN `teams` as `b` ON `b`.`team_id`=`a`.`team1_id`
JOIN `teams` as `c` ON `c`.`team_id`=`a`.`team2_id`
LEFT JOIN `players` `d` ON `d`.`team_id`=`b`.`team_id` OR `d`.`team_id`=`c`.`team_id`
WHERE `a`.`date` >= '2025-10-26'
GROUP BY `a`.`match_id`
SELECT `a`.*, TIME_FORMAT(a.time, '%h:%i:%s %p') as time, CONCAT(b.team_name, ' VS ', c.team_name)team_name
FROM `matches` as `a`
JOIN `teams` as `b` ON `b`.`team_id`=`a`.`team1_id`
JOIN `teams` as `c` ON `c`.`team_id`=`a`.`team2_id`
LEFT JOIN `players` `d` ON `d`.`team_id`=`b`.`team_id` OR `d`.`team_id`=`c`.`team_id`
GROUP BY `a`.`match_id`
 LIMIT 5
SELECT `b`.*
FROM `players` as `a`
INNER JOIN `schedules` as `b` ON `b`.`team_id`=`a`.`team_id`
WHERE `a`.`user_id` = '2'
GROUP BY `b`.`schedule_id`
ORDER BY `b`.`schedule_id` DESC

    public function teamsAndPlayers()
    {
        $data['title']='Teams & Players';
        //teams
        $teamModel = new \App\Models\teamModel();
        $data['page'] = (int) ($this->request->getGet('page') ?? 1);
        $data['perPage'] = 8;

        // Retrieve total count and filtered data
        $data['total'] = $teamModel->where('status', 1)->countAllResults();

        $data['team'] = $teamModel->where('status', 1)
                            ->orderBy('team_id', 'DESC')
                            ->paginate($data['perPage'], 'default', $data['page']);

        $data['pager'] = $teamModel->pager;
        //players
        $playerModel = new \App\Models\playerModel();
        $player = $playerModel->select('registration.fullname,players.*,player_role.roleName,teams.team_name')
                                ->join('registration','players.email=registration.email','LEFT')
                                ->join('player_role','players.roleID=player_role.roleID','LEFT')
                                ->join('teams','players.team_id=teams.team_id','LEFT');

        $page = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 8;
        $player->orderBy('player_id', 'DESC');
        $list = $player->paginate($perPage, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `teams`
WHERE `status` = 1
SELECT *
FROM `teams`
WHERE `status` = 1
ORDER BY `team_id` DESC
 LIMIT 8
SELECT `users`.`Fullname`, `players`.*, `player_role`.`roleName`, `teams`.`team_name`
FROM `players`
LEFT JOIN `users` ON `players`.`user_id`=`users`.`user_id`
LEFT JOIN `player_role` ON `players`.`roleID`=`player_role`.`roleID`
LEFT JOIN `teams` ON `players`.`team_id`=`teams`.`team_id`
ORDER BY `player_id` DESC
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `players`

    public function events()
    {
        $permissionModel = new \App\Models\user_permission();
        $role = $permissionModel->where('role',session()->get('role'))->first();
---
SELECT *
FROM `user_permissions`
WHERE `role` = 'Super-admin'
 LIMIT 1

    public function manageEvent()
    {
        $permissionModel = new \App\Models\user_permission();
        $role = $permissionModel->where('role',session()->get('role'))->first();
---
SELECT *
FROM `user_permissions`
WHERE `role` = 'Super-admin'
 LIMIT 1

    public function editEvent($id)
    {
        $permissionModel = new \App\Models\user_permission();
        $role = $permissionModel->where('role',session()->get('role'))->first();
        if($role['events']==1)
        {
            $data['title'] = 'Edit Event';
            $eventModel = new \App\Models\eventModel();
            $event = $eventModel->where('event_id',$id)->first();
            if(empty($event))
            {
                return redirect()->back();
            }
            $data['event'] = $event;
            $sportModel = new \App\Models\sportsModel();
            $data['sports'] = $sportModel->findAll();
---
SELECT *
FROM `user_permissions`
WHERE `role` = 'Super-admin'
 LIMIT 1
SELECT *
FROM `sports`
WHERE `sportsID` = '1'
 LIMIT 1

    public function matches()
    {
        $permissionModel = new \App\Models\user_permission();
        $role = $permissionModel->where('role',session()->get('role'))->first();
---
SELECT *
FROM `user_permissions`
WHERE `role` = 'Super-admin'
 LIMIT 1

    public function addScoreboard($id)
    {
        $permissionModel = new \App\Models\user_permission();
        $role = $permissionModel->where('role',session()->get('role'))->first();
---
SELECT *
FROM `user_permissions`
WHERE `role` = 'Super-admin'
 LIMIT 1