app/Controllers/Home.php

SELECT *
FROM `codes`
 LIMIT 1
---
        usort($feed, fn($a, $b) => $b['timestamp'] <=> $a['timestamp']);
        //live
        $liveCodeModel = new \App\Models\liveCodeModel();
        $code = $liveCodeModel->first();

SELECT *
FROM `events`
WHERE `event_title` = 'Spring Charity 5K Run'
 LIMIT 1
---
    public function details($id)
    {
        $data['title'] = "Events";
        $model = new \App\Models\eventModel();
        $data['event']= $model->where('event_title',$id)->first();

SELECT COUNT(*) AS `numrows`
FROM `accounts`
SELECT COUNT(*) AS `numrows`
FROM `players`
SELECT COUNT(*) AS `numrows`
FROM `teams`
SELECT COUNT(*) AS `numrows`
FROM `shops`
SELECT *
FROM `events`
WHERE `status` = 1
ORDER BY `event_id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `videos`
SELECT `date`, SUM(total_view)total
FROM `views`
GROUP BY `date`
---
    public function dashboard()
    {
        $title = 'Dashboard';
        //total user
        $accountModel = new \App\Models\AccountModel();
        $account = $accountModel->countAllResults();
        //players
        $playerModel = new \App\Models\playerModel();
        $player = $playerModel->countAllResults();
        //team
        $teamModel = new \App\Models\teamModel();
        $team = $teamModel->countAllResults();
        //shops
        $shopModel = new \App\Models\shopModel();
        $shop = $shopModel->countAllResults();
        //events
        $eventModel = new \App\Models\eventModel();
        $event = $eventModel->WHERE('status',1)->ORDERBY('event_id','DESC')->limit(5)->findAll();
        //count all approved events
        $totalEvents = $eventModel->WHERE('status',1)->countAllResults();
        //videos
        $videoModel = new \App\Models\videoModel();
        $video = $videoModel->countAllResults();
        //total views per day
        $builder = $this->db->table('views');
        $builder->select('date,SUM(total_view)total');
        $builder->groupBy('date');
        $views = $builder->get()->getResult();

SELECT *
FROM `user_permissions`
WHERE `role` = 'Super-admin'
 LIMIT 1
---
    public function teams()
    {
        $permissionModel = new \App\Models\user_permission();
        $role = $permissionModel->where('role',session()->get('role'))->first();

SELECT *
FROM `user_permissions`
WHERE `role` = 'Super-admin'
 LIMIT 1
---
    public function rosterRegistration()
    {
        $permissionModel = new \App\Models\user_permission();
        $role = $permissionModel->where('role',session()->get('role'))->first();

SELECT *
FROM `user_permissions`
WHERE `role` = 'Super-admin'
 LIMIT 1
SELECT *
FROM `sports`
---
    public function videos()
    {
        $permissionModel = new \App\Models\user_permission();
        $role = $permissionModel->where('role',session()->get('role'))->first();
        if($role['videos']==1)
        {
            $title = 'Videos';
            //videos
            $videoModel = new \App\Models\videoModel();
            $video = $videoModel->findAll();
            //sports
            $sportsModel = new \App\Models\sportsModel();
            $sports = $sportsModel->findAll();