app/Controllers/Home.php

SELECT *
FROM `codes`
 LIMIT 1
---
    public function live()
    {
        $data['title'] = "Live";
        $liveCodeModel = new \App\Models\liveCodeModel();
        $code = $liveCodeModel->first();

SELECT *
FROM `events`
WHERE `event_id` = '4'
 LIMIT 1
---
    public function editEvent($id)
    {
        $permissionModel = new \App\Models\user_permission();
        $role = $permissionModel->where('role',session()->get('role'))->first();
        if($role['events']==1)
        {
            $data['title'] = 'Edit Event';
            $eventModel = new \App\Models\eventModel();
            $event = $eventModel->where('event_id',$id)->first();

SELECT *
FROM `user_permissions`
WHERE `role` = 'Super-admin'
 LIMIT 1
SELECT `a`.*, `b`.`team_name` as `home`, `c`.`team_name` as `away`
FROM `matches` `a`
LEFT JOIN `teams` `b` ON `a`.`team1_id`=`b`.`team_id`
LEFT JOIN `teams` `c` ON `a`.`team2_id`=`c`.`team_id`
GROUP BY `a`.`match_id`
---
    public function matches()
    {
        $permissionModel = new \App\Models\user_permission();
        $role = $permissionModel->where('role',session()->get('role'))->first();
        if($role['matches']==1)
        {
            $match = $this->db->table('matches a')
                              ->select('a.*,b.team_name as home,c.team_name as away')
                              ->join('teams b','a.team1_id=b.team_id','LEFT')
                              ->join('teams c','a.team2_id=c.team_id','LEFT')
                              ->groupBy('a.match_id')->get()->getResult();