app/Controllers/Roster.php

SELECT `a`.*, `b`.`Fullname`, `c`.`roleName`
FROM `players` as `a`
LEFT JOIN `registration` as `b` ON `b`.`user_id`=`a`.`user_id`
LEFT JOIN `player_role` as `c` ON `c`.`roleID`=`a`.`roleID`
WHERE `a`.`team_id` = '1'
AND `a`.`status` IN (1,2)
---
    public function playerList()
    {
        $val = $this->request->getGet('teamId');
        //get the list of players
        $data = $this->db->table('players as a')
                ->select('a.*,b.Fullname,c.roleName')
                ->join('registration as b','b.user_id=a.user_id','LEFT')
                ->join('player_role as c','c.roleID=a.roleID','LEFT')
                ->where('a.team_id',$val)
                ->whereIN('a.status',[1,2]);
        $players = $data->get()->getResult();

SELECT `a`.*, TIME_FORMAT(a.time, '%h:%i:%s %p') as time, CONCAT(b.team_name, ' VS ', c.team_name)team_name
FROM `matches` as `a`
JOIN `teams` as `b` ON `b`.`team_id`=`a`.`team1_id`
JOIN `teams` as `c` ON `c`.`team_id`=`a`.`team2_id`
WHERE `a`.`team1_id` = '1'
OR `a`.`team2_id` = '1'
---
    public function matches()
    {
        $val = $this->request->getGet('teamId');
        $builder = $this->db->table('matches as a')
                    ->select("a.*,TIME_FORMAT(a.time, '%h:%i:%s %p') as time,CONCAT(b.team_name,' VS ',c.team_name)team_name")
                    ->join('teams as b','b.team_id=a.team1_id')
                    ->join('teams as c','c.team_id=a.team2_id')
                    ->where('a.team1_id',$val)
                    ->orWhere('a.team2_id',$val);
        $matches = $builder->get()->getResult();