app/Controllers/User.php

SELECT *
FROM `teams`
WHERE `team_id` = '1'
 LIMIT 1
SELECT SUM(wins)wins, SUM(losses)loss, SUM(draws)draw
FROM `team_stats`
WHERE `team_id` = '1'
GROUP BY `team_id`
---
    public function teamInfo()
    {
        $val = $this->request->getGet('value');
        $output='';
        if(!is_numeric($val))
        {
            echo "Invalid! Please try again";
        }
        else
        {
            $teamModel = new \App\Models\teamModel();
            $team = $teamModel->where('team_id',$val)->first();
            //get the total stats
            $statModel = $this->db->table('team_stats')
                    ->select('SUM(wins)wins,SUM(losses)loss,SUM(draws)draw')
                    ->where('team_id',$val)->groupBy('team_id');

SELECT *
FROM `sports`
WHERE `sportsID` = '1'
 LIMIT 1
SELECT *
FROM `staff`
WHERE `team_id` = '1'
---
    public function myTeam($id)
    {
        $data['title']="My Team";
        //load the team data
        $model = new \App\Models\teamModel();
        $team=$model->where('team_name',$id)->first();
        $data['team'] = $team;
        //get sports
        $sportsModel = new \App\Models\sportsModel();
        $data['sportsCategory']= $sportsModel->where('sportsID',$team['sportsID'])->first();
        $staff = new \App\Models\staffModel();
        $data['staff'] = $staff->where('team_id',$team['team_id'])->findAll();