app/Views/details.php

SELECT *
FROM `accounts`
WHERE `accounts`.`accountID` = '1'
---
<?=view('main/templates/main-template')?>
<?php
$accountModel = new \App\Models\AccountModel();
$account = $accountModel->find($event['accountID']);